# System Tools
cask "iterm2"
cask "tunnelblick"
brew "gh"
brew "htop"
brew "ngrok"
brew "tmux"
brew "wget"
brew "tree"
brew "jq"
brew "yq"

# Development - General
cask "visual-studio-code"
brew "pyenv"
brew "pyenv-virtualenv"
brew "node"
brwe "npm"
brew "golang"
brew "rustup-init"

# ops
brew "circleci"
cask "docker"
cask "docker-toolbox"
brew "kubernetes-cli"
brew "helm"
brew "terraform"
brew "terragrunt"
cask "virtualbox"
cask "vagrant"
brew "minikube"
brew "sops"

# Development - Database
cask "dbeaver community edition"

# Productivity
cask "macpass"
cask "slack"
cask "firefox"
cask "google-chrome"
cask "libreoffice"
cask "signal"

# Media
cask "spotify"
