# devsk.dotfiles.packages Brewfile

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "homebrew/cask-fonts"

# System Tools
cask "iterm2"
cask "tunnelblick"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "neovim"
brew "htop"
brew "ngrok"
brew "tmux"
brew "wget"
brew "tree"
brew "jq"

# Development - General
cask "visual-studio-code"
brew "pyenv"
brew "pyenv-virtualenv"
brew "node"
brew "golang"
cask "java"
brew "scala"

# Development - Virtual Resources
brew "circleci"
cask "docker"
cask "docker-toolbox"
brew "kubernetes-cli"
brew "helm"
brew "terraform"
brew "terragrunt"
cask "virtualbox"
cask "vagrant"
brew "minikube"
cask "chef/chef/chefdk"

# Development - Database
brew "postgresql"
cask "datagrip"
cask "dbeaver community edition"

# Productivity
cask "macpass"
cask "slack"
cask "firefox"
cask "google-chrome"
cask "libreoffice"
cask "filezilla"

# Media
cask "spotify"
